{
    "clean_data": "Job Id 07353 Experience 3 to 10 Years Qualifications BCA Salary Range $60K$100K location Andorra la Vella Country Andorra latitude 425063 longitude 15218 Work Type Temporary Company Size 109207 Job Posting Date 20221021 Preference Female Contact Person Tracey Green Contact 001x545 Job Title Legal Advisor Role Corporate Counsel Job Portal FlexJobs Job Description As a Corporate Counsel you will focus on legal matters related to corporate governance mergers and acquisitions and corporate compliance You will draft and review corporate documents oversee compliance programs and handle complex legal negotiations Your role includes managing legal relationships with external partners and providing strategic legal guidance to the company Benefits Employee Referral Programs Financial Counseling Health and Wellness Facilities Casual Dress Code Flexible Spending Accounts FSAs skills Corporate law Compliance Mergers and acquisitions Corporate governance Contract drafting Risk management Legal strategy Due diligence Responsibilities Specialize in corporate law advising companies on legal compliance mergers and acquisitions and corporate governance Ensure legal risk mitigation and compliance with corporate regulations Handle corporate transactions and contracts Company Par Pacific Holdings Company Profile SectorEnergyIndustryPetroleum RefiningCityHoustonStateTexasZip77024Website C Pate",
    "entities": [
        "Benefits Employee Referral Programs Financial Counseling Health and",
        "Company Par Pacific Holdings Company Profile SectorEnergyIndustryPetroleum RefiningCityHoustonStateTexasZip77024Website C Pate",
        "Risk",
        "Work Type Temporary Company Size"
    ],
    "extracted_keywords": [
        "Job",
        "I",
        "d",
        "Experience",
        "Years",
        "Qualifications",
        "BCA",
        "Salary",
        "Range",
        "K",
        "location",
        "Andorra",
        "la",
        "Vella",
        "Country",
        "Andorra",
        "latitude",
        "longitude",
        "Work",
        "Type",
        "Temporary",
        "Company",
        "Size",
        "Job",
        "Posting",
        "Date",
        "Preference",
        "Female",
        "Contact",
        "Person",
        "Tracey",
        "Green",
        "Contact",
        "Job",
        "Title",
        "Legal",
        "Advisor",
        "Role",
        "Corporate",
        "Counsel",
        "Job",
        "Portal",
        "FlexJobs",
        "Job",
        "Description",
        "Corporate",
        "Counsel",
        "matters",
        "governance",
        "mergers",
        "acquisitions",
        "compliance",
        "documents",
        "compliance",
        "programs",
        "negotiations",
        "role",
        "relationships",
        "partners",
        "guidance",
        "company",
        "Employee",
        "Referral",
        "Programs",
        "Financial",
        "Counseling",
        "Health",
        "Wellness",
        "Facilities",
        "Casual",
        "Dress",
        "Code",
        "Flexible",
        "Spending",
        "Accounts",
        "FSAs",
        "law",
        "Compliance",
        "Mergers",
        "acquisitions",
        "governance",
        "Contract",
        "Risk",
        "management",
        "strategy",
        "diligence",
        "Responsibilities",
        "Specialize",
        "law",
        "companies",
        "compliance",
        "mergers",
        "acquisitions",
        "governance",
        "Ensure",
        "risk",
        "mitigation",
        "compliance",
        "regulations",
        "transactions",
        "contracts",
        "Company",
        "Par",
        "Pacific",
        "Holdings",
        "Company",
        "Profile",
        "SectorEnergyIndustryPetroleum",
        "RefiningCityHoustonStateTexasZip77024Website",
        "C",
        "Pate"
    ],
    "job_desc_data": "{'Job Id': '398795164007353', 'Experience': '3 to 10 Years', 'Qualifications': 'BCA', 'Salary Range': '$60K-$100K', 'location': 'Andorra la Vella', 'Country': 'Andorra', 'latitude': '42.5063', 'longitude': '1.5218', 'Work Type': 'Temporary', 'Company Size': '109207', 'Job Posting Date': '2022-10-21', 'Preference': 'Female', 'Contact Person': 'Tracey Green', 'Contact': '001-905-253-0842x545', 'Job Title': 'Legal Advisor', 'Role': 'Corporate Counsel', 'Job Portal': 'FlexJobs', 'Job Description': 'As a Corporate Counsel, you will focus on legal matters related to corporate governance, mergers and acquisitions, and corporate compliance. You will draft and review corporate documents, oversee compliance programs, and handle complex legal negotiations. Your role includes managing legal relationships with external partners and providing strategic legal guidance to the company.', 'Benefits': \"{'Employee Referral Programs, Financial Counseling, Health and Wellness Facilities, Casual Dress Code, Flexible Spending Accounts (FSAs)'}\", 'skills': 'Corporate law Compliance Mergers and acquisitions Corporate governance Contract drafting Risk management Legal strategy Due diligence', 'Responsibilities': 'Specialize in corporate law, advising companies on legal compliance, mergers and acquisitions, and corporate governance. Ensure legal risk mitigation and compliance with corporate regulations. Handle corporate transactions and contracts.', 'Company': 'Par Pacific Holdings', 'Company Profile': '{\"Sector\":\"Energy\",\"Industry\":\"Petroleum Refining\",\"City\":\"Houston\",\"State\":\"Texas\",\"Zip\":\"77024\",\"Website\":\"www.parpacific.com\",\"Ticker\":\"PARR\",\"CEO\":\"William C. Pate\"}'}",
    "unique_id": "c5a64f50-63c6-4b03-a777-dcb47d6c5d1f"
}