{
    "clean_data": "Job Id 680174 Experience 5 to 8 Years Qualifications BCom Salary Range $64K$126K location Muscat Country Oman latitude 214735 longitude 559754 Work Type Temporary Company Size 88387 Job Posting Date 20220704 Preference Female Contact Person Christine Cross Contact  Job Title Sales Representative Role Account Executive Job Portal Idealist Job Description Account Executives manage and grow relationships with existing clients or customers They understand client needs propose solutions negotiate contracts and ensure customer satisfaction often working closely with sales and customer support teams Benefits Life and Disability Insurance Stock Options or Equity Grants Employee Recognition Programs Health Insurance Social and Recreational Activities skills Sales strategy and planning Account management Customer relationship management Solution selling Sales forecasting Contract negotiation Sales metrics and reporting Responsibilities Manage client accounts negotiate contracts and achieve revenue targets by selling products or services Provide ongoing support and solutions to clients Collaborate with crossfunctional teams to meet client needs Company Goldman Sachs Group Company Profile SectorFinancial ServicesIndustryCommercial BanksCityNew YorkStateNew YorkZip10282Website M Solomon",
    "entities": [
        "Muscat",
        "Benefits Life and Disability Insurance Stock Options or Equity Grants Employee Recognition Programs Health Insurance Social and Recreational Activities",
        "Company Goldman Sachs Group Company Profile SectorFinancial ServicesIndustryCommercial BanksCityNew YorkStateNew YorkZip10282Website M Solomon",
        "Collaborate",
        "Responsibilities",
        "Oman",
        "Customer"
    ],
    "extracted_keywords": [
        "Job",
        "I",
        "d",
        "Experience",
        "Years",
        "Qualifications",
        "BCom",
        "Salary",
        "Range",
        "K",
        "location",
        "Muscat",
        "Country",
        "Oman",
        "latitude",
        "Work",
        "Type",
        "Temporary",
        "Company",
        "Size",
        "Job",
        "Posting",
        "Date",
        "Preference",
        "Female",
        "Contact",
        "Person",
        "Christine",
        "Cross",
        "Contact",
        "Job",
        "Title",
        "Sales",
        "Representative",
        "Role",
        "Account",
        "Executive",
        "Job",
        "Portal",
        "Idealist",
        "Job",
        "Description",
        "Account",
        "Executives",
        "relationships",
        "clients",
        "customers",
        "client",
        "solutions",
        "contracts",
        "customer",
        "satisfaction",
        "sales",
        "customer",
        "support",
        "teams",
        "Life",
        "Disability",
        "Insurance",
        "Stock",
        "Options",
        "Equity",
        "Grants",
        "Employee",
        "Recognition",
        "Programs",
        "Health",
        "Insurance",
        "Social",
        "Recreational",
        "Activities",
        "Sales",
        "strategy",
        "planning",
        "Account",
        "management",
        "Customer",
        "relationship",
        "management",
        "Solution",
        "Sales",
        "forecasting",
        "Contract",
        "negotiation",
        "Sales",
        "metrics",
        "Responsibilities",
        "Manage",
        "client",
        "accounts",
        "contracts",
        "revenue",
        "targets",
        "products",
        "services",
        "support",
        "solutions",
        "clients",
        "teams",
        "client",
        "Company",
        "Goldman",
        "Sachs",
        "Group",
        "Company",
        "Profile",
        "SectorFinancial",
        "ServicesIndustryCommercial",
        "BanksCityNew",
        "YorkStateNew",
        "YorkZip10282Website",
        "M",
        "Solomon"
    ],
    "job_desc_data": "{'Job Id': '1051413539680174', 'Experience': '5 to 8 Years', 'Qualifications': 'B.Com', 'Salary Range': '$64K-$126K', 'location': 'Muscat', 'Country': 'Oman', 'latitude': '21.4735', 'longitude': '55.9754', 'Work Type': 'Temporary', 'Company Size': '88387', 'Job Posting Date': '2022-07-04', 'Preference': 'Female', 'Contact Person': 'Christine Cross', 'Contact': '910-899-0915', 'Job Title': 'Sales Representative', 'Role': 'Account Executive', 'Job Portal': 'Idealist', 'Job Description': 'Account Executives manage and grow relationships with existing clients or customers. They understand client needs, propose solutions, negotiate contracts, and ensure customer satisfaction, often working closely with sales and customer support teams.', 'Benefits': \"{'Life and Disability Insurance, Stock Options or Equity Grants, Employee Recognition Programs, Health Insurance, Social and Recreational Activities'}\", 'skills': 'Sales strategy and planning Account management Customer relationship management Solution selling Sales forecasting Contract negotiation Sales metrics and reporting', 'Responsibilities': 'Manage client accounts, negotiate contracts, and achieve revenue targets by selling products or services. Provide ongoing support and solutions to clients. Collaborate with cross-functional teams to meet client needs.', 'Company': 'Goldman Sachs Group', 'Company Profile': '{\"Sector\":\"Financial Services\",\"Industry\":\"Commercial Banks\",\"City\":\"New York\",\"State\":\"New York\",\"Zip\":\"10282\",\"Website\":\"www.goldmansachs.com\",\"Ticker\":\"GS\",\"CEO\":\"David M. Solomon\"}'}",
    "unique_id": "2cc89164-a5e9-407d-a935-d5ede3614c7d"
}