{
    "clean_data": "Job Id 915455 Experience 5 to 12 Years Qualifications BCom Salary Range $58K$90K location Oranjestad Country Aruba latitude 125211 longitude  Work Type PartTime Company Size 58279 Job Posting Date 20230419 Preference Both Contact Person Jeffrey Rubio Contact x22428 Job Title UX/UI Designer Role Interaction Designer Job Portal Indeed Job Description Interaction Designers specialize in designing user interactions within digital interfaces They create meaningful and engaging user experiences by considering user behaviors and system responses Benefits Life and Disability Insurance Stock Options or Equity Grants Employee Recognition Programs Health Insurance Social and Recreational Activities skills Interaction design principles User behavior and psychology Wireframing and prototyping tools Animation and microinteraction design Collaborative design processes Responsibilities Work on interaction design defining how users interact with digital products and ensuring a seamless user journey Create wireframes and prototypes to illustrate interactions Collaborate with developers to implement interaction designs Company EQT Company Profile SectorEnergyIndustryEnergyCityPittsburghStatePennsylvaniaZip15222Website Z Rice",
    "entities": [
        "Benefits Life and Disability Insurance Stock Options or Equity Grants Employee Recognition Programs Health Insurance Social and Recreational Activities"
    ],
    "extracted_keywords": [
        "Job",
        "I",
        "d",
        "Experience",
        "Years",
        "Qualifications",
        "BCom",
        "Salary",
        "Range",
        "K",
        "location",
        "Oranjestad",
        "Country",
        "Aruba",
        "latitude",
        "longitude",
        "Work",
        "Type",
        "PartTime",
        "Company",
        "Size",
        "Job",
        "Posting",
        "Date",
        "Preference",
        "Contact",
        "Person",
        "Jeffrey",
        "Rubio",
        "Contact",
        "x22428",
        "Job",
        "Title",
        "UX",
        "UI",
        "Designer",
        "Role",
        "Interaction",
        "Designer",
        "Job",
        "Portal",
        "Indeed",
        "Job",
        "Description",
        "Interaction",
        "Designers",
        "user",
        "interactions",
        "interfaces",
        "user",
        "experiences",
        "user",
        "behaviors",
        "system",
        "responses",
        "Benefits",
        "Life",
        "Disability",
        "Insurance",
        "Stock",
        "Options",
        "Equity",
        "Grants",
        "Employee",
        "Recognition",
        "Programs",
        "Health",
        "Insurance",
        "Social",
        "Recreational",
        "Activities",
        "Interaction",
        "design",
        "User",
        "behavior",
        "psychology",
        "Wireframing",
        "tools",
        "Animation",
        "microinteraction",
        "design",
        "Collaborative",
        "design",
        "processes",
        "Responsibilities",
        "interaction",
        "design",
        "users",
        "products",
        "user",
        "journey",
        "wireframes",
        "prototypes",
        "interactions",
        "developers",
        "interaction",
        "designs",
        "Company",
        "EQT",
        "Company",
        "Profile",
        "Z",
        "Rice"
    ],
    "job_desc_data": "{'Job Id': '2854342489915455', 'Experience': '5 to 12 Years', 'Qualifications': 'B.Com', 'Salary Range': '$58K-$90K', 'location': 'Oranjestad', 'Country': 'Aruba', 'latitude': '12.5211', 'longitude': '-69.9683', 'Work Type': 'Part-Time', 'Company Size': '58279', 'Job Posting Date': '2023-04-19', 'Preference': 'Both', 'Contact Person': 'Jeffrey Rubio', 'Contact': '664.487.7045x22428', 'Job Title': 'UX/UI Designer', 'Role': 'Interaction Designer', 'Job Portal': 'Indeed', 'Job Description': 'Interaction Designers specialize in designing user interactions within digital interfaces. They create meaningful and engaging user experiences by considering user behaviors and system responses.', 'Benefits': \"{'Life and Disability Insurance, Stock Options or Equity Grants, Employee Recognition Programs, Health Insurance, Social and Recreational Activities'}\", 'skills': 'Interaction design principles User behavior and psychology Wireframing and prototyping tools Animation and micro-interaction design Collaborative design processes', 'Responsibilities': 'Work on interaction design, defining how users interact with digital products and ensuring a seamless user journey. Create wireframes and prototypes to illustrate interactions. Collaborate with developers to implement interaction designs.', 'Company': 'EQT', 'Company Profile': '{\"Sector\":\"Energy\",\"Industry\":\"Energy\",\"City\":\"Pittsburgh\",\"State\":\"Pennsylvania\",\"Zip\":\"15222\",\"Website\":\"www.eqt.com\",\"Ticker\":\"EQT\",\"CEO\":\"Toby Z. Rice\"}'}",
    "unique_id": "10ea5192-968b-408e-86ff-3afdbba93bae"
}