{
    "clean_data": "Job Id 32746 Experience 0 to 8 Years Qualifications BTech Salary Range $63K$89K location Libreville Country Gabon latitude 08037 longitude 116094 Work Type Temporary Company Size 66147 Job Posting Date 20220928 Preference Female Contact Person Amy Stephens Contact 001x776 Job Title Chemical Analyst Role Research Chemist Job Portal CareerBuilder Job Description As a Research Chemist you will engage in scientific research and experimentation to discover and develop new chemical compounds or processes Your work may involve designing experiments analyzing data and publishing research findings Your role contributes to the advancement of scientific knowledge and may have applications in various industries Benefits Life and Disability Insurance Stock Options or Equity Grants Employee Recognition Programs Health Insurance Social and Recreational Activities skills Research chemistry Experimental design Data interpretation Chemical synthesis Research protocols Scientific writing Problemsolving skills Responsibilities Conduct research on chemical properties reactions and formulations Develop new chemical compounds and products Collaborate on research projects and contribute to scientific publications Company Masco Company Profile SectorManufacturingIndustryHome Equipment FurnishingsCityLivoniaStateMichiganZip48152Website J Allman",
    "entities": [
        "Benefits Life and Disability Insurance Stock Options or Equity Grants Employee Recognition Programs Health Insurance Social and Recreational Activities",
        "Work Type Temporary Company Size",
        "Libreville",
        "BTech",
        "Data interpretation Chemical synthesis Research protocols Scientific",
        "Develop"
    ],
    "extracted_keywords": [
        "Job",
        "I",
        "d",
        "Experience",
        "Years",
        "Qualifications",
        "BTech",
        "Salary",
        "Range",
        "K",
        "location",
        "Libreville",
        "Country",
        "Gabon",
        "latitude",
        "longitude",
        "Work",
        "Type",
        "Temporary",
        "Company",
        "Size",
        "Job",
        "Posting",
        "Date",
        "Preference",
        "Female",
        "Contact",
        "Person",
        "Amy",
        "Stephens",
        "Contact",
        "Job",
        "Title",
        "Chemical",
        "Analyst",
        "Role",
        "Research",
        "Chemist",
        "Job",
        "Portal",
        "CareerBuilder",
        "Job",
        "Description",
        "Research",
        "Chemist",
        "research",
        "experimentation",
        "chemical",
        "compounds",
        "work",
        "experiments",
        "data",
        "research",
        "findings",
        "role",
        "advancement",
        "knowledge",
        "applications",
        "industries",
        "Benefits",
        "Life",
        "Disability",
        "Insurance",
        "Stock",
        "Options",
        "Equity",
        "Grants",
        "Employee",
        "Recognition",
        "Programs",
        "Health",
        "Insurance",
        "Social",
        "Recreational",
        "Activities",
        "Research",
        "chemistry",
        "design",
        "Data",
        "interpretation",
        "Chemical",
        "synthesis",
        "Research",
        "protocols",
        "skills",
        "Responsibilities",
        "research",
        "properties",
        "reactions",
        "formulations",
        "chemical",
        "compounds",
        "products",
        "Collaborate",
        "research",
        "projects",
        "publications",
        "Company",
        "Masco",
        "Company",
        "Profile",
        "SectorManufacturingIndustryHome",
        "Equipment",
        "FurnishingsCityLivoniaStateMichiganZip48152Website",
        "J",
        "Allman"
    ],
    "job_desc_data": "{'Job Id': '269356717932746', 'Experience': '0 to 8 Years', 'Qualifications': 'B.Tech', 'Salary Range': '$63K-$89K', 'location': 'Libreville', 'Country': 'Gabon', 'latitude': '-0.8037', 'longitude': '11.6094', 'Work Type': 'Temporary', 'Company Size': '66147', 'Job Posting Date': '2022-09-28', 'Preference': 'Female', 'Contact Person': 'Amy Stephens', 'Contact': '001-510-554-5300x776', 'Job Title': 'Chemical Analyst', 'Role': 'Research Chemist', 'Job Portal': 'CareerBuilder', 'Job Description': 'As a Research Chemist, you will engage in scientific research and experimentation to discover and develop new chemical compounds or processes. Your work may involve designing experiments, analyzing data, and publishing research findings. Your role contributes to the advancement of scientific knowledge and may have applications in various industries.', 'Benefits': \"{'Life and Disability Insurance, Stock Options or Equity Grants, Employee Recognition Programs, Health Insurance, Social and Recreational Activities'}\", 'skills': 'Research chemistry Experimental design Data interpretation Chemical synthesis Research protocols Scientific writing Problem-solving skills', 'Responsibilities': 'Conduct research on chemical properties, reactions, and formulations. Develop new chemical compounds and products. Collaborate on research projects and contribute to scientific publications.', 'Company': 'Masco', 'Company Profile': '{\"Sector\":\"Manufacturing\",\"Industry\":\"Home Equipment, Furnishings\",\"City\":\"Livonia\",\"State\":\"Michigan\",\"Zip\":\"48152\",\"Website\":\"www.masco.com\",\"Ticker\":\"MAS\",\"CEO\":\"Keith J. Allman\"}'}",
    "unique_id": "394ef5f8-9513-4120-b34b-f1d14001aa36"
}