{
    "clean_data": "Job Id 10030 Experience 2 to 11 Years Qualifications MCom Salary Range $64K$108K location Papeete Country French Polynesia latitude  longitude 1494068 Work Type Intern Company Size 85915 Job Posting Date 20230418 Preference Both Contact Person Patricia Meyers Contact +1x28442 Job Title Legal Advisor Role Legal Counsel Job Portal SimplyHired Job Description As a Legal Counsel your responsibilities include providing legal advice drafting contracts and ensuring compliance with laws and regulations You will represent the company in legal matters negotiate agreements and mitigate legal risks Your role involves staying informed about changes in the law and advising management on legal issues affecting the business Benefits Employee Assistance Programs EAP Tuition Reimbursement ProfitSharing Transportation Benefits Parental Leave skills Legal counsel Legal advice Contract negotiation Legal research Litigation support Client representation Legal writing Regulatory compliance Responsibilities Provide legal advice and counsel to individuals businesses or organizations on various legal matters Draft legal documents contracts and agreements Represent clients in negotiations and legal proceedings Company Phillips 66 Company Profile SectorEnergyIndustryPetroleum RefiningCityHoustonStateTexasZip77042Website Lashier",
    "entities": [
        "Benefits Employee Assistance Programs EAP Tuition Reimbursement ProfitSharing Transportation Benefits Parental Leave",
        "Polynesia",
        "Legal",
        "Work Type Intern Company Size",
        "Draft"
    ],
    "extracted_keywords": [
        "Job",
        "I",
        "d",
        "Experience",
        "Years",
        "Qualifications",
        "MCom",
        "Salary",
        "Range",
        "K",
        "location",
        "Papeete",
        "Country",
        "Polynesia",
        "latitude",
        "Work",
        "Type",
        "Intern",
        "Company",
        "Size",
        "Job",
        "Posting",
        "Date",
        "Preference",
        "Contact",
        "Person",
        "Patricia",
        "Meyers",
        "Contact",
        "Job",
        "Title",
        "Legal",
        "Advisor",
        "Role",
        "Legal",
        "Counsel",
        "Job",
        "Portal",
        "SimplyHired",
        "Job",
        "Description",
        "Legal",
        "Counsel",
        "responsibilities",
        "advice",
        "contracts",
        "compliance",
        "laws",
        "regulations",
        "company",
        "matters",
        "agreements",
        "risks",
        "role",
        "changes",
        "law",
        "management",
        "issues",
        "business",
        "Benefits",
        "Employee",
        "Assistance",
        "Programs",
        "EAP",
        "Tuition",
        "Reimbursement",
        "ProfitSharing",
        "Transportation",
        "Benefits",
        "Parental",
        "Leave",
        "counsel",
        "advice",
        "Contract",
        "negotiation",
        "research",
        "Litigation",
        "support",
        "Client",
        "representation",
        "Legal",
        "compliance",
        "Responsibilities",
        "advice",
        "counsel",
        "individuals",
        "businesses",
        "organizations",
        "matters",
        "documents",
        "contracts",
        "agreements",
        "Represent",
        "clients",
        "negotiations",
        "proceedings",
        "Company",
        "Phillips",
        "Company",
        "Profile",
        "SectorEnergyIndustryPetroleum",
        "RefiningCityHoustonStateTexasZip77042Website"
    ],
    "job_desc_data": "{'Job Id': '717540134410030', 'Experience': '2 to 11 Years', 'Qualifications': 'M.Com', 'Salary Range': '$64K-$108K', 'location': 'Papeete', 'Country': 'French Polynesia', 'latitude': '-17.6797', 'longitude': '-149.4068', 'Work Type': 'Intern', 'Company Size': '85915', 'Job Posting Date': '2023-04-18', 'Preference': 'Both', 'Contact Person': 'Patricia Meyers', 'Contact': '+1-841-223-7648x28442', 'Job Title': 'Legal Advisor', 'Role': 'Legal Counsel', 'Job Portal': 'SimplyHired', 'Job Description': 'As a Legal Counsel, your responsibilities include providing legal advice, drafting contracts, and ensuring compliance with laws and regulations. You will represent the company in legal matters, negotiate agreements, and mitigate legal risks. Your role involves staying informed about changes in the law and advising management on legal issues affecting the business.', 'Benefits': \"{'Employee Assistance Programs (EAP), Tuition Reimbursement, Profit-Sharing, Transportation Benefits, Parental Leave'}\", 'skills': 'Legal counsel Legal advice Contract negotiation Legal research Litigation support Client representation Legal writing Regulatory compliance', 'Responsibilities': 'Provide legal advice and counsel to individuals, businesses, or organizations on various legal matters. Draft legal documents, contracts, and agreements. Represent clients in negotiations and legal proceedings.', 'Company': 'Phillips 66', 'Company Profile': '{\"Sector\":\"Energy\",\"Industry\":\"Petroleum Refining\",\"City\":\"Houston\",\"State\":\"Texas\",\"Zip\":\"77042\",\"Website\":\"www.phillips66.com\",\"Ticker\":\"PSX\",\"CEO\":\"Mark Lashier\"}'}",
    "unique_id": "b5b7e0e5-b797-4ad2-9033-2350ac5bac1b"
}