{
    "clean_data": "Job Id 787415 Experience 5 to 13 Years Qualifications BA Salary Range $63K$101K location Tokyo Country Japan latitude 362048 longitude 1382529 Work Type Intern Company Size 100705 Job Posting Date 20230529 Preference Male Contact Person Susan Carroll Contact x250 Job Title Chemical Analyst Role Research Chemist Job Portal USAJOBS Job Description As a Research Chemist you will engage in scientific research and experimentation to discover and develop new chemical compounds or processes Your work may involve designing experiments analyzing data and publishing research findings Your role contributes to the advancement of scientific knowledge and may have applications in various industries Benefits Life and Disability Insurance Stock Options or Equity Grants Employee Recognition Programs Health Insurance Social and Recreational Activities skills Research chemistry Experimental design Data interpretation Chemical synthesis Research protocols Scientific writing Problemsolving skills Responsibilities Conduct research on chemical properties reactions and formulations Develop new chemical compounds and products Collaborate on research projects and contribute to scientific publications Company Ford Motor Company Company Profile SectorAutomotiveIndustryAutomotiveCityDearbornStateMIZip48126Website Farley",
    "entities": [
        "Job Title Chemical",
        "Benefits Life and Disability Insurance Stock Options or Equity Grants Employee Recognition Programs Health Insurance Social and Recreational Activities",
        "Japan",
        "Develop",
        "Tokyo",
        "Work Type Intern Company Size",
        "Data interpretation Chemical synthesis Research protocols Scientific",
        "Ford Motor Company Company"
    ],
    "extracted_keywords": [
        "Job",
        "I",
        "d",
        "Experience",
        "Years",
        "Qualifications",
        "BA",
        "Salary",
        "Range",
        "K",
        "location",
        "Tokyo",
        "Country",
        "Japan",
        "latitude",
        "longitude",
        "Work",
        "Type",
        "Intern",
        "Company",
        "Size",
        "Job",
        "Posting",
        "Date",
        "Preference",
        "Male",
        "Contact",
        "Person",
        "Susan",
        "Carroll",
        "Contact",
        "x250",
        "Job",
        "Title",
        "Chemical",
        "Analyst",
        "Role",
        "Research",
        "Chemist",
        "Job",
        "Portal",
        "USAJOBS",
        "Job",
        "Description",
        "Research",
        "Chemist",
        "research",
        "experimentation",
        "chemical",
        "compounds",
        "work",
        "experiments",
        "data",
        "research",
        "findings",
        "role",
        "advancement",
        "knowledge",
        "applications",
        "industries",
        "Benefits",
        "Life",
        "Disability",
        "Insurance",
        "Stock",
        "Options",
        "Equity",
        "Grants",
        "Employee",
        "Recognition",
        "Programs",
        "Health",
        "Insurance",
        "Social",
        "Recreational",
        "Activities",
        "Research",
        "chemistry",
        "design",
        "Data",
        "interpretation",
        "Chemical",
        "synthesis",
        "Research",
        "protocols",
        "skills",
        "Responsibilities",
        "research",
        "properties",
        "reactions",
        "formulations",
        "chemical",
        "compounds",
        "products",
        "Collaborate",
        "research",
        "projects",
        "publications",
        "Company",
        "Ford",
        "Motor",
        "Company",
        "Company",
        "Profile",
        "SectorAutomotiveIndustryAutomotiveCityDearbornStateMIZip48126Website",
        "Farley"
    ],
    "job_desc_data": "{'Job Id': '2448893141787415', 'Experience': '5 to 13 Years', 'Qualifications': 'BA', 'Salary Range': '$63K-$101K', 'location': 'Tokyo', 'Country': 'Japan', 'latitude': '36.2048', 'longitude': '138.2529', 'Work Type': 'Intern', 'Company Size': '100705', 'Job Posting Date': '2023-05-29', 'Preference': 'Male', 'Contact Person': 'Susan Carroll', 'Contact': '675.692.1651x250', 'Job Title': 'Chemical Analyst', 'Role': 'Research Chemist', 'Job Portal': 'USAJOBS', 'Job Description': 'As a Research Chemist, you will engage in scientific research and experimentation to discover and develop new chemical compounds or processes. Your work may involve designing experiments, analyzing data, and publishing research findings. Your role contributes to the advancement of scientific knowledge and may have applications in various industries.', 'Benefits': \"{'Life and Disability Insurance, Stock Options or Equity Grants, Employee Recognition Programs, Health Insurance, Social and Recreational Activities'}\", 'skills': 'Research chemistry Experimental design Data interpretation Chemical synthesis Research protocols Scientific writing Problem-solving skills', 'Responsibilities': 'Conduct research on chemical properties, reactions, and formulations. Develop new chemical compounds and products. Collaborate on research projects and contribute to scientific publications.', 'Company': 'Ford Motor Company', 'Company Profile': '{\"Sector\":\"Automotive\",\"Industry\":\"Automotive\",\"City\":\"Dearborn\",\"State\":\"MI\",\"Zip\":\"48126\",\"Website\":\"https://www.ford.com/\",\"Ticker\":\"F\",\"CEO\":\"Jim Farley\"}'}",
    "unique_id": "0803d0f3-0d82-4cb8-bfbe-7b0c28336381"
}