{
    "clean_data": "Job Id 613542 Experience 0 to 9 Years Qualifications BBA Salary Range $58K$83K location Moroni Country Comoros latitude 116455 longitude 433333 Work Type PartTime Company Size 81673 Job Posting Date 20230108 Preference Both Contact Person Andrea Shepard Contact x1453 Job Title Chemical Analyst Role Research Chemist Job Portal Jobs2Careers Job Description As a Research Chemist you will engage in scientific research and experimentation to discover and develop new chemical compounds or processes Your work may involve designing experiments analyzing data and publishing research findings Your role contributes to the advancement of scientific knowledge and may have applications in various industries Benefits Health Insurance Retirement Plans Flexible Work Arrangements Employee Assistance Programs EAP Bonuses and Incentive Programs skills Research chemistry Experimental design Data interpretation Chemical synthesis Research protocols Scientific writing Problemsolving skills Responsibilities Conduct research on chemical properties reactions and formulations Develop new chemical compounds and products Collaborate on research projects and contribute to scientific publications Company Bharti Airtel Company Profile SectorTelecommunicationsIndustryTelecommunicationsCityNew DelhiStateDelhiZip110001Website Vittal",
    "entities": [
        "Develop",
        "Data interpretation Chemical synthesis Research protocols Scientific",
        "Health Insurance Retirement Plans Flexible Work Arrangements Employee Assistance Programs EAP Bonuses",
        "Incentive Programs"
    ],
    "extracted_keywords": [
        "Job",
        "I",
        "d",
        "Experience",
        "Years",
        "Qualifications",
        "BBA",
        "Salary",
        "Range",
        "K",
        "location",
        "Moroni",
        "Country",
        "Comoros",
        "latitude",
        "longitude",
        "Work",
        "Type",
        "PartTime",
        "Company",
        "Size",
        "Job",
        "Posting",
        "Date",
        "Preference",
        "Contact",
        "Person",
        "Andrea",
        "Shepard",
        "Contact",
        "Job",
        "Title",
        "Chemical",
        "Analyst",
        "Role",
        "Research",
        "Chemist",
        "Job",
        "Portal",
        "Jobs2Careers",
        "Job",
        "Description",
        "Research",
        "Chemist",
        "research",
        "experimentation",
        "chemical",
        "compounds",
        "work",
        "experiments",
        "data",
        "research",
        "findings",
        "role",
        "advancement",
        "knowledge",
        "applications",
        "industries",
        "Benefits",
        "Health",
        "Insurance",
        "Retirement",
        "Plans",
        "Flexible",
        "Work",
        "Arrangements",
        "Employee",
        "Assistance",
        "Programs",
        "EAP",
        "Bonuses",
        "Incentive",
        "Programs",
        "Research",
        "chemistry",
        "design",
        "Data",
        "interpretation",
        "Chemical",
        "synthesis",
        "Research",
        "protocols",
        "skills",
        "Responsibilities",
        "research",
        "properties",
        "reactions",
        "formulations",
        "chemical",
        "compounds",
        "products",
        "Collaborate",
        "research",
        "projects",
        "publications",
        "Company",
        "Bharti",
        "Airtel",
        "Company"
    ],
    "job_desc_data": "{'Job Id': '2446413675613542', 'Experience': '0 to 9 Years', 'Qualifications': 'BBA', 'Salary Range': '$58K-$83K', 'location': 'Moroni', 'Country': 'Comoros', 'latitude': '-11.6455', 'longitude': '43.3333', 'Work Type': 'Part-Time', 'Company Size': '81673', 'Job Posting Date': '2023-01-08', 'Preference': 'Both', 'Contact Person': 'Andrea Shepard', 'Contact': '305.465.9292x1453', 'Job Title': 'Chemical Analyst', 'Role': 'Research Chemist', 'Job Portal': 'Jobs2Careers', 'Job Description': 'As a Research Chemist, you will engage in scientific research and experimentation to discover and develop new chemical compounds or processes. Your work may involve designing experiments, analyzing data, and publishing research findings. Your role contributes to the advancement of scientific knowledge and may have applications in various industries.', 'Benefits': \"{'Health Insurance, Retirement Plans, Flexible Work Arrangements, Employee Assistance Programs (EAP), Bonuses and Incentive Programs'}\", 'skills': 'Research chemistry Experimental design Data interpretation Chemical synthesis Research protocols Scientific writing Problem-solving skills', 'Responsibilities': 'Conduct research on chemical properties, reactions, and formulations. Develop new chemical compounds and products. Collaborate on research projects and contribute to scientific publications.', 'Company': 'Bharti Airtel', 'Company Profile': '{\"Sector\":\"Telecommunications\",\"Industry\":\"Telecommunications\",\"City\":\"New Delhi\",\"State\":\"Delhi\",\"Zip\":\"110001\",\"Website\":\"www.airtel.in\",\"Ticker\":\"BHARTIARTL\",\"CEO\":\"Gopal Vittal\"}'}",
    "unique_id": "9444d9bf-b6c0-4092-b7f2-ba71cbde3d59"
}