{
    "clean_data": "Job Id 875715 Experience 3 to 15 Years Qualifications BBA Salary Range $60K$125K location Caracas Country Venezuela RB latitude 64238 longitude 665897 Work Type Intern Company Size 28688 Job Posting Date 20230408 Preference Both Contact Person Michael Mccormick Contact  Job Title Legal Advisor Role Legal Counsel Job Portal FlexJobs Job Description As a Legal Counsel your responsibilities include providing legal advice drafting contracts and ensuring compliance with laws and regulations You will represent the company in legal matters negotiate agreements and mitigate legal risks Your role involves staying informed about changes in the law and advising management on legal issues affecting the business Benefits Employee Assistance Programs EAP Tuition Reimbursement ProfitSharing Transportation Benefits Parental Leave skills Legal counsel Legal advice Contract negotiation Legal research Litigation support Client representation Legal writing Regulatory compliance Responsibilities Provide legal advice and counsel to individuals businesses or organizations on various legal matters Draft legal documents contracts and agreements Represent clients in negotiations and legal proceedings Company United States Steel Company Profile SectorMetals and MiningIndustryMetalsCityPittsburghStatePennsylvaniaZip15219Website B Burritt",
    "entities": [
        "Benefits Employee Assistance Programs EAP Tuition Reimbursement ProfitSharing Transportation Benefits Parental Leave",
        "Company United States Steel Company Profile SectorMetals",
        "Venezuela",
        "Legal",
        "Work Type Intern Company Size",
        "Caracas",
        "Draft"
    ],
    "extracted_keywords": [
        "Job",
        "I",
        "d",
        "Experience",
        "Years",
        "Qualifications",
        "BBA",
        "Salary",
        "Range",
        "60K$125",
        "K",
        "location",
        "Caracas",
        "Country",
        "Venezuela",
        "RB",
        "latitude",
        "Work",
        "Type",
        "Intern",
        "Company",
        "Size",
        "Job",
        "Posting",
        "Date",
        "Preference",
        "Contact",
        "Person",
        "Michael",
        "Mccormick",
        "Contact",
        "Job",
        "Title",
        "Legal",
        "Advisor",
        "Role",
        "Legal",
        "Counsel",
        "Job",
        "Portal",
        "FlexJobs",
        "Job",
        "Description",
        "Legal",
        "Counsel",
        "responsibilities",
        "advice",
        "contracts",
        "compliance",
        "laws",
        "regulations",
        "company",
        "matters",
        "agreements",
        "risks",
        "role",
        "changes",
        "law",
        "management",
        "issues",
        "business",
        "Benefits",
        "Employee",
        "Assistance",
        "Programs",
        "EAP",
        "Tuition",
        "Reimbursement",
        "ProfitSharing",
        "Transportation",
        "Benefits",
        "Parental",
        "Leave",
        "counsel",
        "advice",
        "Contract",
        "negotiation",
        "research",
        "Litigation",
        "support",
        "Client",
        "representation",
        "Legal",
        "compliance",
        "Responsibilities",
        "advice",
        "counsel",
        "individuals",
        "businesses",
        "organizations",
        "matters",
        "documents",
        "contracts",
        "agreements",
        "Represent",
        "clients",
        "negotiations",
        "proceedings",
        "Company",
        "United",
        "States",
        "Steel",
        "Company",
        "Profile",
        "SectorMetals",
        "B",
        "Burritt"
    ],
    "job_desc_data": "{'Job Id': '2347400598875715', 'Experience': '3 to 15 Years', 'Qualifications': 'BBA', 'Salary Range': '$60K-$125K', 'location': 'Caracas', 'Country': 'Venezuela, RB', 'latitude': '6.4238', 'longitude': '-66.5897', 'Work Type': 'Intern', 'Company Size': '28688', 'Job Posting Date': '2023-04-08', 'Preference': 'Both', 'Contact Person': 'Michael Mccormick', 'Contact': '988.734.8958', 'Job Title': 'Legal Advisor', 'Role': 'Legal Counsel', 'Job Portal': 'FlexJobs', 'Job Description': 'As a Legal Counsel, your responsibilities include providing legal advice, drafting contracts, and ensuring compliance with laws and regulations. You will represent the company in legal matters, negotiate agreements, and mitigate legal risks. Your role involves staying informed about changes in the law and advising management on legal issues affecting the business.', 'Benefits': \"{'Employee Assistance Programs (EAP), Tuition Reimbursement, Profit-Sharing, Transportation Benefits, Parental Leave'}\", 'skills': 'Legal counsel Legal advice Contract negotiation Legal research Litigation support Client representation Legal writing Regulatory compliance', 'Responsibilities': 'Provide legal advice and counsel to individuals, businesses, or organizations on various legal matters. Draft legal documents, contracts, and agreements. Represent clients in negotiations and legal proceedings.', 'Company': 'United States Steel', 'Company Profile': '{\"Sector\":\"Metals and Mining\",\"Industry\":\"Metals\",\"City\":\"Pittsburgh\",\"State\":\"Pennsylvania\",\"Zip\":\"15219\",\"Website\":\"www.ussteel.com\",\"Ticker\":\"X\",\"CEO\":\"David B. Burritt\"}'}",
    "unique_id": "63307e2a-ab8d-4684-8531-9be492bd9a08"
}