{
    "clean_data": "Job Id 68226 Experience 2 to 15 Years Qualifications BCA Salary Range $65K$128K location PortoNovo Country Benin latitude 93077 longitude 23158 Work Type Contract Company Size 104815 Job Posting Date 20230702 Preference Female Contact Person William Spencer Contact  Job Title Legal Advisor Role Corporate Counsel Job Portal Idealist Job Description As a Corporate Counsel you will focus on legal matters related to corporate governance mergers and acquisitions and corporate compliance You will draft and review corporate documents oversee compliance programs and handle complex legal negotiations Your role includes managing legal relationships with external partners and providing strategic legal guidance to the company Benefits Health Insurance Retirement Plans Flexible Work Arrangements Employee Assistance Programs EAP Bonuses and Incentive Programs skills Corporate law Compliance Mergers and acquisitions Corporate governance Contract drafting Risk management Legal strategy Due diligence Responsibilities Specialize in corporate law advising companies on legal compliance mergers and acquisitions and corporate governance Ensure legal risk mitigation and compliance with corporate regulations Handle corporate transactions and contracts Company Philip Morris International Company Profile SectorTobaccoIndustryTobaccoCityStamfordStateConnecticutZip6901Website Olczak",
    "entities": [
        "Work Type Contract Company Size",
        "Philip Morris International Company",
        "Risk",
        "Incentive Programs",
        "Health Insurance Retirement Plans Flexible Work Arrangements Employee Assistance Programs EAP Bonuses"
    ],
    "extracted_keywords": [
        "Job",
        "I",
        "d",
        "Experience",
        "Years",
        "Qualifications",
        "BCA",
        "Salary",
        "Range",
        "K",
        "location",
        "PortoNovo",
        "Country",
        "Benin",
        "latitude",
        "Work",
        "Type",
        "Contract",
        "Company",
        "Size",
        "Job",
        "Posting",
        "Date",
        "Preference",
        "Female",
        "Contact",
        "Person",
        "William",
        "Spencer",
        "Contact",
        "Job",
        "Title",
        "Legal",
        "Advisor",
        "Role",
        "Corporate",
        "Counsel",
        "Job",
        "Portal",
        "Idealist",
        "Job",
        "Description",
        "Corporate",
        "Counsel",
        "matters",
        "governance",
        "mergers",
        "acquisitions",
        "compliance",
        "documents",
        "compliance",
        "programs",
        "negotiations",
        "role",
        "relationships",
        "partners",
        "guidance",
        "company",
        "Benefits",
        "Health",
        "Insurance",
        "Retirement",
        "Plans",
        "Flexible",
        "Work",
        "Arrangements",
        "Employee",
        "Assistance",
        "Programs",
        "EAP",
        "Bonuses",
        "Incentive",
        "Programs",
        "law",
        "Compliance",
        "Mergers",
        "acquisitions",
        "governance",
        "Contract",
        "Risk",
        "management",
        "strategy",
        "diligence",
        "Responsibilities",
        "Specialize",
        "law",
        "companies",
        "compliance",
        "mergers",
        "acquisitions",
        "governance",
        "Ensure",
        "risk",
        "mitigation",
        "compliance",
        "regulations",
        "transactions",
        "contracts",
        "Company",
        "Philip",
        "Morris",
        "International",
        "Company",
        "Profile",
        "SectorTobaccoIndustryTobaccoCityStamfordStateConnecticutZip6901Website",
        "Olczak"
    ],
    "job_desc_data": "{'Job Id': '958087324468226', 'Experience': '2 to 15 Years', 'Qualifications': 'BCA', 'Salary Range': '$65K-$128K', 'location': 'Porto-Novo', 'Country': 'Benin', 'latitude': '9.3077', 'longitude': '2.3158', 'Work Type': 'Contract', 'Company Size': '104815', 'Job Posting Date': '2023-07-02', 'Preference': 'Female', 'Contact Person': 'William Spencer', 'Contact': '567-757-4789', 'Job Title': 'Legal Advisor', 'Role': 'Corporate Counsel', 'Job Portal': 'Idealist', 'Job Description': 'As a Corporate Counsel, you will focus on legal matters related to corporate governance, mergers and acquisitions, and corporate compliance. You will draft and review corporate documents, oversee compliance programs, and handle complex legal negotiations. Your role includes managing legal relationships with external partners and providing strategic legal guidance to the company.', 'Benefits': \"{'Health Insurance, Retirement Plans, Flexible Work Arrangements, Employee Assistance Programs (EAP), Bonuses and Incentive Programs'}\", 'skills': 'Corporate law Compliance Mergers and acquisitions Corporate governance Contract drafting Risk management Legal strategy Due diligence', 'Responsibilities': 'Specialize in corporate law, advising companies on legal compliance, mergers and acquisitions, and corporate governance. Ensure legal risk mitigation and compliance with corporate regulations. Handle corporate transactions and contracts.', 'Company': 'Philip Morris International', 'Company Profile': '{\"Sector\":\"Tobacco\",\"Industry\":\"Tobacco\",\"City\":\"Stamford\",\"State\":\"Connecticut\",\"Zip\":\"6901\",\"Website\":\"www.pmi.com\",\"Ticker\":\"PM\",\"CEO\":\"Jacek Olczak\"}'}",
    "unique_id": "fb1c8cee-3f8a-4a0b-8496-f824cb6f3397"
}