{
    "clean_data": "Job Id 020359 Experience 2 to 15 Years Qualifications BTech Salary Range $59K$85K location Zagreb Country Croatia latitude 451 longitude 152 Work Type Temporary Company Size 95894 Job Posting Date 20230528 Preference Both Contact Person Logan Allen Contact 001x329 Job Title Sales Representative Role Inside Sales Representative Job Portal Internshipscom Job Description Inside Sales Representatives are responsible for selling products or services to customers over the phone or through online channels They engage with leads answer customer inquiries and use persuasive communication to close sales and meet revenue targets Benefits Life and Disability Insurance Stock Options or Equity Grants Employee Recognition Programs Health Insurance Social and Recreational Activities skills Sales prospecting and lead generation Sales presentation and communication CRM software eg Salesforce Sales negotiation and closing techniques Product knowledge Relationship building Responsibilities Identify and qualify sales leads conduct sales presentations and close deals through phone and email Maintain accurate sales records and reports Provide excellent customer service throughout the sales process Company Truist Financial Company Profile SectorFinancial ServicesIndustryCommercial BanksCityCharlotteStateNorth CarolinaZip28202Website H Rogers Jr",
    "entities": [
        "Company Truist Financial Company Profile SectorFinancial ServicesIndustryCommercial",
        "Benefits Life and Disability Insurance Stock Options or Equity Grants Employee Recognition Programs Health Insurance Social and Recreational Activities",
        "Work Type Temporary Company Size",
        "Job Portal Internshipscom Job Description Inside Sales Representatives",
        "Responsibilities Identify"
    ],
    "extracted_keywords": [
        "Job",
        "I",
        "d",
        "Experience",
        "Years",
        "Qualifications",
        "BTech",
        "Salary",
        "Range",
        "K",
        "location",
        "Zagreb",
        "Country",
        "Croatia",
        "latitude",
        "Work",
        "Type",
        "Temporary",
        "Company",
        "Size",
        "Job",
        "Posting",
        "Date",
        "Preference",
        "Contact",
        "Person",
        "Logan",
        "Allen",
        "Contact",
        "Job",
        "Title",
        "Sales",
        "Representative",
        "Role",
        "Sales",
        "Representative",
        "Job",
        "Portal",
        "Internshipscom",
        "Job",
        "Description",
        "Sales",
        "Representatives",
        "products",
        "services",
        "customers",
        "phone",
        "channels",
        "leads",
        "answer",
        "customer",
        "inquiries",
        "communication",
        "sales",
        "revenue",
        "targets",
        "Benefits",
        "Life",
        "Disability",
        "Insurance",
        "Stock",
        "Options",
        "Equity",
        "Grants",
        "Employee",
        "Recognition",
        "Programs",
        "Health",
        "Insurance",
        "Social",
        "Recreational",
        "Activities",
        "Sales",
        "generation",
        "Sales",
        "presentation",
        "communication",
        "CRM",
        "software",
        "eg",
        "Salesforce",
        "Sales",
        "negotiation",
        "closing",
        "techniques",
        "Product",
        "knowledge",
        "Relationship",
        "building",
        "Responsibilities",
        "sales",
        "conduct",
        "sales",
        "presentations",
        "deals",
        "phone",
        "email",
        "sales",
        "records",
        "reports",
        "customer",
        "service",
        "sales",
        "process",
        "Company",
        "Truist",
        "Financial",
        "Company",
        "Profile",
        "SectorFinancial",
        "ServicesIndustryCommercial",
        "BanksCityCharlotteStateNorth",
        "CarolinaZip28202Website",
        "H",
        "Rogers",
        "Jr"
    ],
    "job_desc_data": "{'Job Id': '1350967866020359', 'Experience': '2 to 15 Years', 'Qualifications': 'B.Tech', 'Salary Range': '$59K-$85K', 'location': 'Zagreb', 'Country': 'Croatia', 'latitude': '45.1', 'longitude': '15.2', 'Work Type': 'Temporary', 'Company Size': '95894', 'Job Posting Date': '2023-05-28', 'Preference': 'Both', 'Contact Person': 'Logan Allen', 'Contact': '001-425-539-7373x329', 'Job Title': 'Sales Representative', 'Role': 'Inside Sales Representative', 'Job Portal': 'Internships.com', 'Job Description': 'Inside Sales Representatives are responsible for selling products or services to customers over the phone or through online channels. They engage with leads, answer customer inquiries, and use persuasive communication to close sales and meet revenue targets.', 'Benefits': \"{'Life and Disability Insurance, Stock Options or Equity Grants, Employee Recognition Programs, Health Insurance, Social and Recreational Activities'}\", 'skills': 'Sales prospecting and lead generation Sales presentation and communication CRM software (e.g., Salesforce) Sales negotiation and closing techniques Product knowledge Relationship building', 'Responsibilities': 'Identify and qualify sales leads, conduct sales presentations, and close deals through phone and email. Maintain accurate sales records and reports. Provide excellent customer service throughout the sales process.', 'Company': 'Truist Financial', 'Company Profile': '{\"Sector\":\"Financial Services\",\"Industry\":\"Commercial Banks\",\"City\":\"Charlotte\",\"State\":\"North Carolina\",\"Zip\":\"28202\",\"Website\":\"www.truist.com\",\"Ticker\":\"TFC\",\"CEO\":\"William H. Rogers Jr.\"}'}",
    "unique_id": "4823b03d-98e2-4eb2-9c43-14b6a4ba06cb"
}