{
    "clean_data": "Job Id 05556 Experience 0 to 8 Years Qualifications MCA Salary Range $64K$99K location Nuku?alofa Country Tonga latitude 211789 longitude 1751982 Work Type PartTime Company Size 16887 Job Posting Date 20220702 Preference Male Contact Person Melissa Johnson Contact +1 Job Title Legal Advisor Role Corporate Counsel Job Portal Internshipscom Job Description As a Corporate Counsel you will focus on legal matters related to corporate governance mergers and acquisitions and corporate compliance You will draft and review corporate documents oversee compliance programs and handle complex legal negotiations Your role includes managing legal relationships with external partners and providing strategic legal guidance to the company Benefits Life and Disability Insurance Stock Options or Equity Grants Employee Recognition Programs Health Insurance Social and Recreational Activities skills Corporate law Compliance Mergers and acquisitions Corporate governance Contract drafting Risk management Legal strategy Due diligence Responsibilities Specialize in corporate law advising companies on legal compliance mergers and acquisitions and corporate governance Ensure legal risk mitigation and compliance with corporate regulations Handle corporate transactions and contracts Company Biogen Company Profile SectorBiotechnologyIndustryPharmaceuticalsCityCambridgeStateMassachusettsZip2142Website A Viehbacher",
    "entities": [
        "Risk",
        "Benefits Life and Disability Insurance Stock Options or Equity Grants Employee Recognition Programs Health Insurance Social and Recreational Activities",
        "Country Tonga",
        "Company Biogen Company Profile SectorBiotechnologyIndustryPharmaceuticalsCityCambridgeStateMassachusettsZip2142Website A Viehbacher"
    ],
    "extracted_keywords": [
        "Job",
        "I",
        "d",
        "Experience",
        "Years",
        "Qualifications",
        "MCA",
        "Salary",
        "Range",
        "K",
        "location",
        "Nuku?alofa",
        "Country",
        "Tonga",
        "latitude",
        "Work",
        "Type",
        "PartTime",
        "Company",
        "Size",
        "Job",
        "Posting",
        "Date",
        "Preference",
        "Male",
        "Contact",
        "Person",
        "Melissa",
        "Johnson",
        "Contact",
        "+1",
        "Job",
        "Title",
        "Legal",
        "Advisor",
        "Role",
        "Corporate",
        "Counsel",
        "Job",
        "Portal",
        "Internshipscom",
        "Job",
        "Description",
        "Corporate",
        "Counsel",
        "matters",
        "governance",
        "mergers",
        "acquisitions",
        "compliance",
        "documents",
        "compliance",
        "programs",
        "negotiations",
        "role",
        "relationships",
        "partners",
        "guidance",
        "company",
        "Life",
        "Disability",
        "Insurance",
        "Stock",
        "Options",
        "Equity",
        "Grants",
        "Employee",
        "Recognition",
        "Programs",
        "Health",
        "Insurance",
        "Social",
        "Recreational",
        "Activities",
        "law",
        "Compliance",
        "Mergers",
        "acquisitions",
        "governance",
        "Contract",
        "Risk",
        "management",
        "strategy",
        "diligence",
        "Responsibilities",
        "Specialize",
        "law",
        "companies",
        "compliance",
        "mergers",
        "acquisitions",
        "governance",
        "Ensure",
        "risk",
        "mitigation",
        "compliance",
        "regulations",
        "transactions",
        "contracts",
        "Company",
        "Biogen",
        "Company",
        "SectorBiotechnologyIndustryPharmaceuticalsCityCambridgeStateMassachusettsZip2142Website",
        "A",
        "Viehbacher"
    ],
    "job_desc_data": "{'Job Id': '915919263605556', 'Experience': '0 to 8 Years', 'Qualifications': 'MCA', 'Salary Range': '$64K-$99K', 'location': 'Nuku?alofa', 'Country': 'Tonga', 'latitude': '-21.1789', 'longitude': '-175.1982', 'Work Type': 'Part-Time', 'Company Size': '16887', 'Job Posting Date': '2022-07-02', 'Preference': 'Male', 'Contact Person': 'Melissa Johnson', 'Contact': '+1-246-772-0517', 'Job Title': 'Legal Advisor', 'Role': 'Corporate Counsel', 'Job Portal': 'Internships.com', 'Job Description': 'As a Corporate Counsel, you will focus on legal matters related to corporate governance, mergers and acquisitions, and corporate compliance. You will draft and review corporate documents, oversee compliance programs, and handle complex legal negotiations. Your role includes managing legal relationships with external partners and providing strategic legal guidance to the company.', 'Benefits': \"{'Life and Disability Insurance, Stock Options or Equity Grants, Employee Recognition Programs, Health Insurance, Social and Recreational Activities'}\", 'skills': 'Corporate law Compliance Mergers and acquisitions Corporate governance Contract drafting Risk management Legal strategy Due diligence', 'Responsibilities': 'Specialize in corporate law, advising companies on legal compliance, mergers and acquisitions, and corporate governance. Ensure legal risk mitigation and compliance with corporate regulations. Handle corporate transactions and contracts.', 'Company': 'Biogen', 'Company Profile': '{\"Sector\":\"Biotechnology\",\"Industry\":\"Pharmaceuticals\",\"City\":\"Cambridge\",\"State\":\"Massachusetts\",\"Zip\":\"2142\",\"Website\":\"www.biogen.com\",\"Ticker\":\"BIIB\",\"CEO\":\"Christopher A. Viehbacher\"}'}",
    "unique_id": "bde3561f-27b5-4cd6-9c9b-4d95a2398913"
}