{
    "clean_data": "Job Id 064975 Experience 5 to 11 Years Qualifications BBA Salary Range $61K$116K location Yerevan Country Armenia latitude 400691 longitude 450382 Work Type Intern Company Size 104884 Job Posting Date 20221117 Preference Male Contact Person Kara Turner Contact  Job Title Pediatrician Role Pediatric Surgeon Job Portal Idealist Job Description Pediatric Surgeons specialize in performing surgical procedures on children including infants and adolescents They diagnose surgical conditions perform surgeries and collaborate with other healthcare professionals to ensure the best outcomes Benefits Life and Disability Insurance Stock Options or Equity Grants Employee Recognition Programs Health Insurance Social and Recreational Activities skills Pediatric surgery Surgical procedures for children Operating room protocols Patient care Surgical techniques Pediatric anesthesia Responsibilities Perform surgical procedures on pediatric patients including congenital abnormalities and injuries Coordinate preoperative and postoperative care Ensure the wellbeing and recovery of young patients Company Wells Fargo Company Profile SectorFinancial ServicesIndustryCommercial BanksCitySan FranciscoStateCaliforniaZip94104Website W Scharf",
    "entities": [
        "Wells Fargo Company Profile SectorFinancial ServicesIndustryCommercial BanksCitySan",
        "Benefits Life and Disability Insurance Stock Options or Equity Grants Employee Recognition Programs Health Insurance Social and Recreational Activities"
    ],
    "extracted_keywords": [
        "Job",
        "I",
        "d",
        "Experience",
        "Years",
        "Qualifications",
        "BBA",
        "Salary",
        "Range",
        "K",
        "location",
        "Yerevan",
        "Country",
        "Armenia",
        "latitude",
        "longitude",
        "Work",
        "Type",
        "Intern",
        "Company",
        "Size",
        "Job",
        "Posting",
        "Date",
        "Preference",
        "Male",
        "Contact",
        "Person",
        "Kara",
        "Turner",
        "Contact",
        "Job",
        "Title",
        "Pediatrician",
        "Role",
        "Pediatric",
        "Surgeon",
        "Job",
        "Portal",
        "Idealist",
        "Job",
        "Description",
        "Pediatric",
        "Surgeons",
        "procedures",
        "children",
        "infants",
        "adolescents",
        "conditions",
        "surgeries",
        "healthcare",
        "professionals",
        "outcomes",
        "Benefits",
        "Life",
        "Disability",
        "Insurance",
        "Stock",
        "Options",
        "Equity",
        "Grants",
        "Employee",
        "Recognition",
        "Programs",
        "Health",
        "Insurance",
        "Social",
        "Recreational",
        "Activities",
        "surgery",
        "procedures",
        "children",
        "room",
        "protocols",
        "Patient",
        "care",
        "techniques",
        "Pediatric",
        "anesthesia",
        "Responsibilities",
        "procedures",
        "patients",
        "abnormalities",
        "injuries",
        "care",
        "wellbeing",
        "recovery",
        "patients",
        "Company",
        "Wells",
        "Fargo",
        "Company",
        "Profile",
        "SectorFinancial",
        "ServicesIndustryCommercial",
        "BanksCitySan",
        "FranciscoStateCaliforniaZip94104Website",
        "W",
        "Scharf"
    ],
    "job_desc_data": "{'Job Id': '1735458564064975', 'Experience': '5 to 11 Years', 'Qualifications': 'BBA', 'Salary Range': '$61K-$116K', 'location': 'Yerevan', 'Country': 'Armenia', 'latitude': '40.0691', 'longitude': '45.0382', 'Work Type': 'Intern', 'Company Size': '104884', 'Job Posting Date': '2022-11-17', 'Preference': 'Male', 'Contact Person': 'Kara Turner', 'Contact': '846-306-1390', 'Job Title': 'Pediatrician', 'Role': 'Pediatric Surgeon', 'Job Portal': 'Idealist', 'Job Description': 'Pediatric Surgeons specialize in performing surgical procedures on children, including infants and adolescents. They diagnose surgical conditions, perform surgeries, and collaborate with other healthcare professionals to ensure the best outcomes.', 'Benefits': \"{'Life and Disability Insurance, Stock Options or Equity Grants, Employee Recognition Programs, Health Insurance, Social and Recreational Activities'}\", 'skills': 'Pediatric surgery Surgical procedures for children Operating room protocols Patient care Surgical techniques Pediatric anesthesia', 'Responsibilities': 'Perform surgical procedures on pediatric patients, including congenital abnormalities and injuries. Coordinate pre-operative and post-operative care. Ensure the well-being and recovery of young patients.', 'Company': 'Wells Fargo', 'Company Profile': '{\"Sector\":\"Financial Services\",\"Industry\":\"Commercial Banks\",\"City\":\"San Francisco\",\"State\":\"California\",\"Zip\":\"94104\",\"Website\":\"www.wellsfargo.com\",\"Ticker\":\"WFC\",\"CEO\":\"Charles W. Scharf\"}'}",
    "unique_id": "8cb72d74-d0b5-4325-b694-61ec83bb7048"
}