{
    "clean_data": "Job Id 748271 Experience 2 to 11 Years Qualifications MTech Salary Range $61K$124K location Gitega Country Burundi latitude 33731 longitude 299189 Work Type Contract Company Size 61533 Job Posting Date 20211220 Preference Female Contact Person Joseph Johnson Contact  Job Title SEO Analyst Role Technical SEO Analyst Job Portal Internshipscom Job Description As a Technical SEO Analyst your role is to analyze website performance and identify opportunities for optimization You will work on improving site speed mobilefriendliness and other technical aspects to enhance search engine rankings You will also perform keyword research conduct competitive analysis and provide recommendations to improve website SEO Benefits Life and Disability Insurance Stock Options or Equity Grants Employee Recognition Programs Health Insurance Social and Recreational Activities skills Technical SEO Website audits SEO tools eg Screaming Frog Ahrefs Schema markup Site speed optimization XML sitemaps Canonicalization Responsibilities Focus on technical aspects of SEO including website structure page speed and mobile optimization Conduct technical SEO audits and provide recommendations for website improvements Collaborate with web developers on technical SEO implementations Company Dominion Energy Company Profile SectorEnergyIndustryUtilities Gas and ElectricCityRichmondStateVirginiaZip23219Website M Blue",
    "entities": [
        "XML",
        "Work Type Contract Company Size",
        "Job Portal Internshipscom Job Description",
        "Company Dominion Energy Company Profile SectorEnergyIndustryUtilities Gas",
        "SEO Benefits Life and Disability Insurance Stock Options or Equity Grants Employee Recognition Programs Health Insurance Social and Recreational Activities skills Technical SEO Website"
    ],
    "extracted_keywords": [
        "Job",
        "I",
        "d",
        "Experience",
        "Years",
        "Qualifications",
        "MTech",
        "Salary",
        "Range",
        "K",
        "location",
        "Gitega",
        "Country",
        "Burundi",
        "latitude",
        "longitude",
        "Work",
        "Type",
        "Contract",
        "Company",
        "Size",
        "Job",
        "Posting",
        "Date",
        "Preference",
        "Female",
        "Contact",
        "Person",
        "Joseph",
        "Johnson",
        "Contact",
        "Job",
        "Title",
        "SEO",
        "Analyst",
        "Role",
        "Technical",
        "SEO",
        "Analyst",
        "Job",
        "Portal",
        "Internshipscom",
        "Job",
        "Description",
        "SEO",
        "Analyst",
        "role",
        "website",
        "performance",
        "opportunities",
        "optimization",
        "site",
        "speed",
        "mobilefriendliness",
        "aspects",
        "search",
        "engine",
        "keyword",
        "research",
        "conduct",
        "analysis",
        "recommendations",
        "website",
        "SEO",
        "Benefits",
        "Life",
        "Disability",
        "Insurance",
        "Stock",
        "Options",
        "Equity",
        "Grants",
        "Employee",
        "Recognition",
        "Programs",
        "Health",
        "Insurance",
        "Social",
        "Recreational",
        "Activities",
        "SEO",
        "Website",
        "audits",
        "SEO",
        "tools",
        "Screaming",
        "Frog",
        "Ahrefs",
        "Schema",
        "Site",
        "speed",
        "optimization",
        "XML",
        "Canonicalization",
        "Responsibilities",
        "Focus",
        "aspects",
        "SEO",
        "website",
        "structure",
        "page",
        "speed",
        "optimization",
        "Conduct",
        "SEO",
        "audits",
        "recommendations",
        "website",
        "improvements",
        "Collaborate",
        "web",
        "developers",
        "SEO",
        "implementations",
        "Company",
        "Dominion",
        "Energy",
        "Company",
        "Profile",
        "SectorEnergyIndustryUtilities",
        "Gas",
        "ElectricCityRichmondStateVirginiaZip23219Website",
        "M",
        "Blue"
    ],
    "job_desc_data": "{'Job Id': '2548872231748271', 'Experience': '2 to 11 Years', 'Qualifications': 'M.Tech', 'Salary Range': '$61K-$124K', 'location': 'Gitega', 'Country': 'Burundi', 'latitude': '-3.3731', 'longitude': '29.9189', 'Work Type': 'Contract', 'Company Size': '61533', 'Job Posting Date': '2021-12-20', 'Preference': 'Female', 'Contact Person': 'Joseph Johnson', 'Contact': '959-307-8456', 'Job Title': 'SEO Analyst', 'Role': 'Technical SEO Analyst', 'Job Portal': 'Internships.com', 'Job Description': 'As a Technical SEO Analyst, your role is to analyze website performance and identify opportunities for optimization. You will work on improving site speed, mobile-friendliness, and other technical aspects to enhance search engine rankings. You will also perform keyword research, conduct competitive analysis, and provide recommendations to improve website SEO.', 'Benefits': \"{'Life and Disability Insurance, Stock Options or Equity Grants, Employee Recognition Programs, Health Insurance, Social and Recreational Activities'}\", 'skills': 'Technical SEO Website audits SEO tools (e.g., Screaming Frog, Ahrefs) Schema markup Site speed optimization XML sitemaps Canonicalization', 'Responsibilities': 'Focus on technical aspects of SEO, including website structure, page speed, and mobile optimization. Conduct technical SEO audits and provide recommendations for website improvements. Collaborate with web developers on technical SEO implementations.', 'Company': 'Dominion Energy', 'Company Profile': '{\"Sector\":\"Energy\",\"Industry\":\"Utilities: Gas and Electric\",\"City\":\"Richmond\",\"State\":\"Virginia\",\"Zip\":\"23219\",\"Website\":\"www.dominionenergy.com\",\"Ticker\":\"D\",\"CEO\":\"Robert M. Blue\"}'}",
    "unique_id": "8f194a72-53e6-40c3-9d7a-a0805e5afcda"
}