{
    "clean_data": "Job Id 96498 Experience 5 to 8 Years Qualifications BBA Salary Range $63K$86K location Moroni Country Comoros latitude 116455 longitude 433333 Work Type Intern Company Size 41498 Job Posting Date 20220624 Preference Both Contact Person Nicholas Hunter Contact 001x869 Job Title Legal Advisor Role Corporate Counsel Job Portal Idealist Job Description As a Corporate Counsel you will focus on legal matters related to corporate governance mergers and acquisitions and corporate compliance You will draft and review corporate documents oversee compliance programs and handle complex legal negotiations Your role includes managing legal relationships with external partners and providing strategic legal guidance to the company Benefits Casual Dress Code Social and Recreational Activities Employee Referral Programs Health and Wellness Facilities Life and Disability Insurance skills Corporate law Compliance Mergers and acquisitions Corporate governance Contract drafting Risk management Legal strategy Due diligence Responsibilities Specialize in corporate law advising companies on legal compliance mergers and acquisitions and corporate governance Ensure legal risk mitigation and compliance with corporate regulations Handle corporate transactions and contracts Company Liberty Mutual Insurance Group Company Profile SectorInsuranceIndustryInsurance Property and Casualty Stock)CityBostonStateMassachusettsZip2116Website Sweeney",
    "entities": [
        "Sweeney",
        "Risk",
        "Company Liberty Mutual Insurance Group Company Profile SectorInsuranceIndustryInsurance Property and Casualty"
    ],
    "extracted_keywords": [
        "Job",
        "I",
        "d",
        "Experience",
        "Years",
        "Qualifications",
        "BBA",
        "Salary",
        "Range",
        "K",
        "location",
        "Moroni",
        "Country",
        "Comoros",
        "latitude",
        "longitude",
        "Work",
        "Type",
        "Intern",
        "Company",
        "Size",
        "Job",
        "Posting",
        "Date",
        "Preference",
        "Contact",
        "Person",
        "Nicholas",
        "Hunter",
        "Contact",
        "Job",
        "Title",
        "Legal",
        "Advisor",
        "Role",
        "Corporate",
        "Counsel",
        "Job",
        "Portal",
        "Idealist",
        "Job",
        "Description",
        "Corporate",
        "Counsel",
        "matters",
        "governance",
        "mergers",
        "acquisitions",
        "compliance",
        "documents",
        "compliance",
        "programs",
        "negotiations",
        "role",
        "relationships",
        "partners",
        "guidance",
        "company",
        "Casual",
        "Dress",
        "Code",
        "Social",
        "Recreational",
        "Activities",
        "Employee",
        "Referral",
        "Programs",
        "Health",
        "Wellness",
        "Facilities",
        "Life",
        "Disability",
        "Insurance",
        "law",
        "Compliance",
        "Mergers",
        "acquisitions",
        "governance",
        "Contract",
        "Risk",
        "management",
        "strategy",
        "diligence",
        "Responsibilities",
        "Specialize",
        "law",
        "companies",
        "compliance",
        "mergers",
        "acquisitions",
        "governance",
        "Ensure",
        "risk",
        "mitigation",
        "compliance",
        "regulations",
        "transactions",
        "contracts",
        "Company",
        "Liberty",
        "Mutual",
        "Insurance",
        "Group",
        "Company",
        "Profile",
        "Property",
        "Casualty",
        "Stock)CityBostonStateMassachusettsZip2116Website",
        "Sweeney"
    ],
    "job_desc_data": "{'Job Id': '276597178896498', 'Experience': '5 to 8 Years', 'Qualifications': 'BBA', 'Salary Range': '$63K-$86K', 'location': 'Moroni', 'Country': 'Comoros', 'latitude': '-11.6455', 'longitude': '43.3333', 'Work Type': 'Intern', 'Company Size': '41498', 'Job Posting Date': '2022-06-24', 'Preference': 'Both', 'Contact Person': 'Nicholas Hunter', 'Contact': '001-996-813-8191x869', 'Job Title': 'Legal Advisor', 'Role': 'Corporate Counsel', 'Job Portal': 'Idealist', 'Job Description': 'As a Corporate Counsel, you will focus on legal matters related to corporate governance, mergers and acquisitions, and corporate compliance. You will draft and review corporate documents, oversee compliance programs, and handle complex legal negotiations. Your role includes managing legal relationships with external partners and providing strategic legal guidance to the company.', 'Benefits': \"{'Casual Dress Code, Social and Recreational Activities, Employee Referral Programs, Health and Wellness Facilities, Life and Disability Insurance'}\", 'skills': 'Corporate law Compliance Mergers and acquisitions Corporate governance Contract drafting Risk management Legal strategy Due diligence', 'Responsibilities': 'Specialize in corporate law, advising companies on legal compliance, mergers and acquisitions, and corporate governance. Ensure legal risk mitigation and compliance with corporate regulations. Handle corporate transactions and contracts.', 'Company': 'Liberty Mutual Insurance Group', 'Company Profile': '{\"Sector\":\"Insurance\",\"Industry\":\"Insurance: Property and Casualty (Stock)\",\"City\":\"Boston\",\"State\":\"Massachusetts\",\"Zip\":\"2116\",\"Website\":\"www.libertymutual.com\",\"Ticker\":\"\",\"CEO\":\"Timothy Sweeney\"}'}",
    "unique_id": "fd9f428e-256e-44c8-8edb-03501a0e9539"
}