{
    "clean_data": "Job Id 602599 Experience 2 to 15 Years Qualifications MCom Salary Range $63K$101K location Prague Country Czech Republic latitude 498175 longitude 15473 Work Type Intern Company Size 102997 Job Posting Date 20211110 Preference Male Contact Person Troy Green Contact  Job Title Chemical Analyst Role Research Chemist Job Portal Internshipscom Job Description As a Research Chemist you will engage in scientific research and experimentation to discover and develop new chemical compounds or processes Your work may involve designing experiments analyzing data and publishing research findings Your role contributes to the advancement of scientific knowledge and may have applications in various industries Benefits Legal Assistance Bonuses and Incentive Programs Wellness Programs Employee Discounts Retirement Plans skills Research chemistry Experimental design Data interpretation Chemical synthesis Research protocols Scientific writing Problemsolving skills Responsibilities Conduct research on chemical properties reactions and formulations Develop new chemical compounds and products Collaborate on research projects and contribute to scientific publications Company Laboratory Corp of America Company Profile SectorHealthcare ServicesIndustryHealth Care Pharmacy and Other ServicesCityBurlingtonStateNorth CarolinaZip27215Website H Schechter",
    "entities": [
        "Company Laboratory Corp of America Company Profile SectorHealthcare ServicesIndustryHealth Care Pharmacy and Other ServicesCityBurlingtonStateNorth",
        "Czech Republic",
        "Prague",
        "Data interpretation Chemical synthesis Research protocols Scientific",
        "Work Type Intern Company Size",
        "Develop"
    ],
    "extracted_keywords": [
        "Job",
        "I",
        "d",
        "Experience",
        "Years",
        "Qualifications",
        "MCom",
        "Salary",
        "Range",
        "K",
        "location",
        "Prague",
        "Country",
        "Czech",
        "Republic",
        "latitude",
        "Work",
        "Type",
        "Intern",
        "Company",
        "Size",
        "Job",
        "Posting",
        "Date",
        "Preference",
        "Male",
        "Contact",
        "Person",
        "Troy",
        "Green",
        "Contact",
        "Job",
        "Title",
        "Chemical",
        "Analyst",
        "Role",
        "Research",
        "Chemist",
        "Job",
        "Portal",
        "Internshipscom",
        "Job",
        "Description",
        "Research",
        "Chemist",
        "research",
        "experimentation",
        "chemical",
        "compounds",
        "work",
        "experiments",
        "data",
        "research",
        "findings",
        "role",
        "advancement",
        "knowledge",
        "applications",
        "industries",
        "Benefits",
        "Legal",
        "Assistance",
        "Bonuses",
        "Incentive",
        "Programs",
        "Wellness",
        "Programs",
        "Employee",
        "Discounts",
        "Retirement",
        "Plans",
        "Research",
        "chemistry",
        "design",
        "Data",
        "interpretation",
        "Chemical",
        "synthesis",
        "Research",
        "protocols",
        "skills",
        "Responsibilities",
        "research",
        "properties",
        "reactions",
        "formulations",
        "chemical",
        "compounds",
        "products",
        "Collaborate",
        "research",
        "projects",
        "publications",
        "Company",
        "Laboratory",
        "Corp",
        "America",
        "Company",
        "Profile",
        "SectorHealthcare",
        "ServicesIndustryHealth",
        "Care",
        "Pharmacy",
        "ServicesCityBurlingtonStateNorth",
        "H",
        "Schechter"
    ],
    "job_desc_data": "{'Job Id': '2927878065602599', 'Experience': '2 to 15 Years', 'Qualifications': 'M.Com', 'Salary Range': '$63K-$101K', 'location': 'Prague', 'Country': 'Czech Republic', 'latitude': '49.8175', 'longitude': '15.473', 'Work Type': 'Intern', 'Company Size': '102997', 'Job Posting Date': '2021-11-10', 'Preference': 'Male', 'Contact Person': 'Troy Green', 'Contact': '308-469-4451', 'Job Title': 'Chemical Analyst', 'Role': 'Research Chemist', 'Job Portal': 'Internships.com', 'Job Description': 'As a Research Chemist, you will engage in scientific research and experimentation to discover and develop new chemical compounds or processes. Your work may involve designing experiments, analyzing data, and publishing research findings. Your role contributes to the advancement of scientific knowledge and may have applications in various industries.', 'Benefits': \"{'Legal Assistance, Bonuses and Incentive Programs, Wellness Programs, Employee Discounts, Retirement Plans'}\", 'skills': 'Research chemistry Experimental design Data interpretation Chemical synthesis Research protocols Scientific writing Problem-solving skills', 'Responsibilities': 'Conduct research on chemical properties, reactions, and formulations. Develop new chemical compounds and products. Collaborate on research projects and contribute to scientific publications.', 'Company': 'Laboratory Corp. of America', 'Company Profile': '{\"Sector\":\"Healthcare Services\",\"Industry\":\"Health Care: Pharmacy and Other Services\",\"City\":\"Burlington\",\"State\":\"North Carolina\",\"Zip\":\"27215\",\"Website\":\"www.labcorp.com\",\"Ticker\":\"LH\",\"CEO\":\"Adam H. Schechter\"}'}",
    "unique_id": "d6948ab5-f7ba-4251-8d3e-9c091f220c87"
}