{
    "clean_data": "Job Id 30308 Experience 0 to 12 Years Qualifications BCA Salary Range $64K$80K location Freetown Country Sierra Leone latitude 84606 longitude  Work Type PartTime Company Size 101506 Job Posting Date 20230130 Preference Both Contact Person Emily Ray Contact 001x379 Job Title Legal Advisor Role Corporate Counsel Job Portal Jobs2Careers Job Description As a Corporate Counsel you will focus on legal matters related to corporate governance mergers and acquisitions and corporate compliance You will draft and review corporate documents oversee compliance programs and handle complex legal negotiations Your role includes managing legal relationships with external partners and providing strategic legal guidance to the company Benefits Employee Referral Programs Financial Counseling Health and Wellness Facilities Casual Dress Code Flexible Spending Accounts FSAs skills Corporate law Compliance Mergers and acquisitions Corporate governance Contract drafting Risk management Legal strategy Due diligence Responsibilities Specialize in corporate law advising companies on legal compliance mergers and acquisitions and corporate governance Ensure legal risk mitigation and compliance with corporate regulations Handle corporate transactions and contracts Company Reynolds American Inc Company Profile SectorTobaccoIndustryTobaccoCityWinstonSalemStateNCZip27102Website",
    "entities": [
        "Freetown Country Sierra Leone",
        "Risk",
        "Reynolds American Inc Company",
        "Benefits Employee Referral Programs Financial Counseling Health and"
    ],
    "extracted_keywords": [
        "Job",
        "I",
        "d",
        "Experience",
        "Years",
        "Qualifications",
        "BCA",
        "Salary",
        "Range",
        "K",
        "location",
        "Freetown",
        "Country",
        "Sierra",
        "Leone",
        "latitude",
        "longitude",
        "Work",
        "Type",
        "PartTime",
        "Company",
        "Size",
        "Job",
        "Posting",
        "Date",
        "Preference",
        "Contact",
        "Person",
        "Emily",
        "Ray",
        "Contact",
        "001x379",
        "Job",
        "Title",
        "Legal",
        "Advisor",
        "Role",
        "Corporate",
        "Counsel",
        "Job",
        "Portal",
        "Jobs2Careers",
        "Job",
        "Description",
        "Corporate",
        "Counsel",
        "matters",
        "governance",
        "mergers",
        "acquisitions",
        "compliance",
        "documents",
        "compliance",
        "programs",
        "negotiations",
        "role",
        "relationships",
        "partners",
        "guidance",
        "company",
        "Employee",
        "Referral",
        "Programs",
        "Financial",
        "Counseling",
        "Health",
        "Wellness",
        "Facilities",
        "Casual",
        "Dress",
        "Code",
        "Flexible",
        "Spending",
        "Accounts",
        "FSAs",
        "law",
        "Compliance",
        "Mergers",
        "acquisitions",
        "governance",
        "Contract",
        "Risk",
        "management",
        "strategy",
        "diligence",
        "Responsibilities",
        "Specialize",
        "law",
        "companies",
        "compliance",
        "mergers",
        "acquisitions",
        "governance",
        "Ensure",
        "risk",
        "mitigation",
        "compliance",
        "regulations",
        "transactions",
        "contracts",
        "Company",
        "Reynolds",
        "American",
        "Inc",
        "Company",
        "SectorTobaccoIndustryTobaccoCityWinstonSalemStateNCZip27102Website"
    ],
    "job_desc_data": "{'Job Id': '316814334530308', 'Experience': '0 to 12 Years', 'Qualifications': 'BCA', 'Salary Range': '$64K-$80K', 'location': 'Freetown', 'Country': 'Sierra Leone', 'latitude': '8.4606', 'longitude': '-11.7799', 'Work Type': 'Part-Time', 'Company Size': '101506', 'Job Posting Date': '2023-01-30', 'Preference': 'Both', 'Contact Person': 'Emily Ray', 'Contact': '001-214-312-8406x379', 'Job Title': 'Legal Advisor', 'Role': 'Corporate Counsel', 'Job Portal': 'Jobs2Careers', 'Job Description': 'As a Corporate Counsel, you will focus on legal matters related to corporate governance, mergers and acquisitions, and corporate compliance. You will draft and review corporate documents, oversee compliance programs, and handle complex legal negotiations. Your role includes managing legal relationships with external partners and providing strategic legal guidance to the company.', 'Benefits': \"{'Employee Referral Programs, Financial Counseling, Health and Wellness Facilities, Casual Dress Code, Flexible Spending Accounts (FSAs)'}\", 'skills': 'Corporate law Compliance Mergers and acquisitions Corporate governance Contract drafting Risk management Legal strategy Due diligence', 'Responsibilities': 'Specialize in corporate law, advising companies on legal compliance, mergers and acquisitions, and corporate governance. Ensure legal risk mitigation and compliance with corporate regulations. Handle corporate transactions and contracts.', 'Company': 'Reynolds American Inc.', 'Company Profile': '{\"Sector\":\"Tobacco\",\"Industry\":\"Tobacco\",\"City\":\"Winston-Salem\",\"State\":\"NC\",\"Zip\":\"27102\",\"Website\":\"https://www.reynoldsamerican.com/\",\"Ticker\":\"N/A\",\"CEO\":\"N/A\"}'}",
    "unique_id": "b19385fa-01c5-48de-8947-fa8676fdaa95"
}