{
    "clean_data": "Job Id 04683 Experience 5 to 13 Years Qualifications MBA Salary Range $55K$120K location Yaounde Country Cameroon latitude 73697 longitude 123547 Work Type FullTime Company Size 55606 Job Posting Date 20211121 Preference Both Contact Person Tasha Huber Contact  Job Title Legal Advisor Role Corporate Counsel Job Portal LinkedIn Job Description As a Corporate Counsel you will focus on legal matters related to corporate governance mergers and acquisitions and corporate compliance You will draft and review corporate documents oversee compliance programs and handle complex legal negotiations Your role includes managing legal relationships with external partners and providing strategic legal guidance to the company Benefits Transportation Benefits Professional Development Bonuses and Incentive Programs ProfitSharing Employee Discounts skills Corporate law Compliance Mergers and acquisitions Corporate governance Contract drafting Risk management Legal strategy Due diligence Responsibilities Specialize in corporate law advising companies on legal compliance mergers and acquisitions and corporate governance Ensure legal risk mitigation and compliance with corporate regulations Handle corporate transactions and contracts Company Bajaj Finserv Company Profile SectorFinancial ServicesIndustryBanking and Financial ServicesCityPuneStateMaharashtraZip411014Website Bajaj",
    "entities": [
        "Risk",
        "Incentive Programs ProfitSharing Employee Discounts",
        "Benefits Transportation Benefits Professional Development Bonuses",
        "Company Bajaj Finserv Company Profile SectorFinancial ServicesIndustryBanking and Financial ServicesCityPuneStateMaharashtraZip411014Website Bajaj"
    ],
    "extracted_keywords": [
        "Job",
        "I",
        "d",
        "Experience",
        "Years",
        "Qualifications",
        "MBA",
        "Salary",
        "Range",
        "K",
        "location",
        "Yaounde",
        "Country",
        "Cameroon",
        "latitude",
        "Work",
        "Type",
        "FullTime",
        "Company",
        "Size",
        "Job",
        "Posting",
        "Date",
        "Preference",
        "Contact",
        "Person",
        "Tasha",
        "Huber",
        "Contact",
        "Job",
        "Title",
        "Legal",
        "Advisor",
        "Role",
        "Corporate",
        "Counsel",
        "Job",
        "Portal",
        "LinkedIn",
        "Job",
        "Description",
        "Corporate",
        "Counsel",
        "matters",
        "governance",
        "mergers",
        "acquisitions",
        "compliance",
        "documents",
        "compliance",
        "programs",
        "negotiations",
        "role",
        "relationships",
        "partners",
        "guidance",
        "company",
        "Benefits",
        "Transportation",
        "Benefits",
        "Professional",
        "Development",
        "Bonuses",
        "Incentive",
        "Programs",
        "ProfitSharing",
        "Employee",
        "Discounts",
        "law",
        "Compliance",
        "Mergers",
        "acquisitions",
        "governance",
        "Contract",
        "Risk",
        "management",
        "strategy",
        "diligence",
        "Responsibilities",
        "Specialize",
        "law",
        "companies",
        "compliance",
        "mergers",
        "acquisitions",
        "governance",
        "Ensure",
        "risk",
        "mitigation",
        "compliance",
        "regulations",
        "transactions",
        "contracts",
        "Company",
        "Bajaj",
        "Finserv",
        "Company",
        "Profile",
        "SectorFinancial",
        "ServicesIndustryBanking",
        "Financial",
        "ServicesCityPuneStateMaharashtraZip411014Website",
        "Bajaj"
    ],
    "job_desc_data": "{'Job Id': '768631369704683', 'Experience': '5 to 13 Years', 'Qualifications': 'MBA', 'Salary Range': '$55K-$120K', 'location': 'Yaounde', 'Country': 'Cameroon', 'latitude': '7.3697', 'longitude': '12.3547', 'Work Type': 'Full-Time', 'Company Size': '55606', 'Job Posting Date': '2021-11-21', 'Preference': 'Both', 'Contact Person': 'Tasha Huber', 'Contact': '9477619841', 'Job Title': 'Legal Advisor', 'Role': 'Corporate Counsel', 'Job Portal': 'LinkedIn', 'Job Description': 'As a Corporate Counsel, you will focus on legal matters related to corporate governance, mergers and acquisitions, and corporate compliance. You will draft and review corporate documents, oversee compliance programs, and handle complex legal negotiations. Your role includes managing legal relationships with external partners and providing strategic legal guidance to the company.', 'Benefits': \"{'Transportation Benefits, Professional Development, Bonuses and Incentive Programs, Profit-Sharing, Employee Discounts'}\", 'skills': 'Corporate law Compliance Mergers and acquisitions Corporate governance Contract drafting Risk management Legal strategy Due diligence', 'Responsibilities': 'Specialize in corporate law, advising companies on legal compliance, mergers and acquisitions, and corporate governance. Ensure legal risk mitigation and compliance with corporate regulations. Handle corporate transactions and contracts.', 'Company': 'Bajaj Finserv', 'Company Profile': '{\"Sector\":\"Financial Services\",\"Industry\":\"Banking and Financial Services\",\"City\":\"Pune\",\"State\":\"Maharashtra\",\"Zip\":\"411014\",\"Website\":\"https://www.bajajfinserv.in/\",\"Ticker\":\"BAJAJFINSV\",\"CEO\":\"Sanjiv Bajaj\"}'}",
    "unique_id": "2df980fe-afac-4e15-aa35-80c5e8c4127f"
}